In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('D:/Project/Data Sciences/pandas/uforeports.csv' )
df1 = pd.read_csv('D:/Project/Data Sciences/pandas/Customers_2.csv')

In [3]:
df1

   CustomerID  Gender  Age  Annual Income(k$)  Spending Score
0           6  Female   26                600              65
1           7    Male   32                700              32
2           8    Male   41                105              46
3           9  Female   20                210              12
4          10    Male   19                202              56

In [5]:
df1['Spending Score'].median()

46.0

In [6]:
df.describe()

           City Colors Reported Shape Reported  State              Time
count     18215            2882          15597  18241             18241
unique     6475              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [7]:
df['City'].count()

18215

In [8]:
df['City'].value_counts()

City
Seattle          187
New York City    161
Phoenix          137
Houston          108
Las Vegas        105
                ...
Lake Sonoma        1
Von Ormy           1
Grosse Pointe      1
Grosse Point       1
Ybor               1
Name: count, Length: 6475, dtype: int64

In [9]:
df['City'].value_counts()

City
Seattle          187
New York City    161
Phoenix          137
Houston          108
Las Vegas        105
                ...
Lake Sonoma        1
Von Ormy           1
Grosse Pointe      1
Grosse Point       1
Ybor               1
Name: count, Length: 6475, dtype: int64

In [10]:
df['City'].value_counts(normalize=True)

City
Seattle          0.010266
New York City    0.008839
Phoenix          0.007521
Houston          0.005929
Las Vegas        0.005764
                   ...
Lake Sonoma      0.000055
Von Ormy         0.000055
Grosse Pointe    0.000055
Grosse Point     0.000055
Ybor             0.000055
Name: proportion, Length: 6475, dtype: float64

In [11]:
df['City'].value_counts()

City
Seattle          187
New York City    161
Phoenix          137
Houston          108
Las Vegas        105
                ...
Lake Sonoma        1
Von Ormy           1
Grosse Pointe      1
Grosse Point       1
Ybor               1
Name: count, Length: 6475, dtype: int64

In [12]:
country_grp = df.groupby(['City'])

In [13]:
filt = df['City'] == 'Eagle River'
df.loc[filt].value_counts()

City         Colors Reported  Shape Reported  State  Time
Eagle River  RED              LIGHT           AK     4/24/2000 23:15     1
                                              WI     12/31/2000 23:45    1
Name: count, dtype: int64

In [14]:
country_grp['City'].value_counts(normalize=True).loc['Eagle River']

1.0

In [19]:
# column Name
column_name = ['sales_number','sales_order_line','Order_date','customer_Name','Email_Addree','Item','Quantity','unit_Price','Taxt_Amount']

In [27]:
df_2021 = pd.read_csv('D:/Project/Data Sciences/pandas/2021.csv', names=column_name )

In [21]:
df_2021.head()

,sales_number,sales_order_line,Order_date,customer_Name,Email_Addree,Item,Quantity,unit_Price,Taxt_Amount
0,SO49171,1,2021-01-01,Mariah Foster,mariah21@adventure-works.com,"Road-250 Black, 48",1,2181.5625,174.5250
1,SO49172,1,2021-01-01,Brian Howard,brian23@adventure-works.com,"Road-250 Red, 44",1,2443.3500,195.4680
2,SO49173,1,2021-01-01,Linda Alvarez,linda19@adventure-works.com,"Mountain-200 Silver, 38",1,2071.4196,165.7136
3,SO49174,1,2021-01-01,Gina Hernandez,gina4@adventure-works.com,"Mountain-200 Silver, 42",1,2071.4196,165.7136
4,SO49178,1,2021-01-01,Beth Ruiz,beth4@adventure-works.com,"Road-550-W Yellow, 44",1,1000.4375,80.0350

In [29]:
df_2021

,sales_number,sales_order_line,Order_date,customer_Name,Email_Addree,Item,Quantity,unit_Price,Taxt_Amount
0,SO49171,1,2021-01-01,Mariah Foster,mariah21@adventure-works.com,"Road-250 Black, 48",1,2181.5625,174.5250
1,SO49172,1,2021-01-01,Brian Howard,brian23@adventure-works.com,"Road-250 Red, 44",1,2443.3500,195.4680
2,SO49173,1,2021-01-01,Linda Alvarez,linda19@adventure-works.com,"Mountain-200 Silver, 38",1,2071.4196,165.7136
3,SO49174,1,2021-01-01,Gina Hernandez,gina4@adventure-works.com,"Mountain-200 Silver, 42",1,2071.4196,165.7136
4,SO49178,1,2021-01-01,Beth Ruiz,beth4@adventure-works.com,"Road-550-W Yellow, 44",1,1000.4375,80.0350
...,...,...,...,...,...,...,...,...,...
28779,SO63093,2,2021-12-31,Rebekah Martin,rebekah20@adventure-works.com,Patch Kit/8 Patches,1,2.2900,0.1832
28780,SO63113,1,2021-12-31,Carolyn Alonso,carolyn29@adventure-works.com,"Road-550-W Yellow, 48",1,1120.4900,89.6392
28781,SO63113,2,2021-12-31,Carolyn Alonso,carolyn29@adventure-works.com,"Short-Sleeve Classic Jersey, S",1,53.9900,4.3192
28782,SO63066,1,2021-12-31,Teresa Navarro,teresa10@adventure-works.com,Mountain Tire Tube,1,4.9900,0.3992
28783,SO63066,2,2021-12-31,Teresa Navarro,teresa10@adventure-works.com,Patch Kit/8 Patches,1,2.2900,0.1832

In [33]:
df_2021['sales_number'].median

<bound method Series.median of 0        SO49171
1        SO49172
2        SO49173
3        SO49174
4        SO49178
          ...
28779    SO63093
28780    SO63113
28781    SO63113
28782    SO63066
28783    SO63066
Name: sales_number, Length: 28784, dtype: object>